app/views/books/index.html.erb

      <div class="col-md-4">
        <%= select_tag :genre, options_for_select([["All Genres", ""]] + Genre.pluck(:name, :name), params[:genre]), include_blank: true, class: "form-select" %>
---
SELECT "genres"."name", "genres"."name" FROM "genres"