app/controllers/books_controller.rb

  def index
    @books = Book.all
    @books = @books.where(genre: params[:genre]) if params[:genre].present?
    @books = @books.where("LOWER(title) LIKE ?", "%#{params[:query].downcase}%") if params[:query].present?
    @books = @books.page(params[:page]).per(10)
---
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."genre_id" = ?  [["genre_id", 2]]
SELECT 1 AS one FROM "books" WHERE "books"."genre" = ? AND (LOWER(title) LIKE '%fundamentals %') LIMIT ? OFFSET ?  [["genre", "2"], ["LIMIT", 1], ["OFFSET", 0]]
SELECT "genres".* FROM "genres"
SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books"

  def show_by_author
    @books = Book.where(author: params[:author_name]).page(params[:page]).per(10).distinct
---
SELECT DISTINCT "books".* FROM "books" WHERE "books"."author" = ?  [["author", "Goswami, Jaideva"]]

  def show_by_genre
    puts "Received genre parameter: #{params[:genre]}"
    @books = Book.where(genre: params[:genre]).page(params[:page]).per(10).distinct
---
SELECT COUNT(DISTINCT "books"."id") FROM "books" WHERE "books"."genre" = ?  [["genre", "history"]]
SELECT DISTINCT "books".* FROM "books" WHERE "books"."genre" = ?  [["genre", "mathematics"]]

  def show_by_publisher
    @books = Book.where(publisher: params[:publisher]).page(params[:page]).per(10).distinct
---
SELECT "books".* FROM "books" WHERE "books"."publisher" = ?  [["publisher", "Wiley"]]
SELECT COUNT(DISTINCT "books"."id") FROM "books" WHERE "books"."publisher" = ?  [["publisher", "Penguin"]]